tap "aws/tap"
tap "cyberark/tools"
tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "warrensbox/tap"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Text processing system for reStructuredText
brew "docutils"
# Official Amazon AWS command-line interface
brew "awscli"
# Simple command-line tool to read AWS CloudWatch logs
brew "awslogs"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Programmable completion for Bash 4.2+
brew "bash-completion@2", link: false
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Create and read constant databases
brew "cdb"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Isolated development environments using Docker
brew "docker-compose", link: false
# Modern replacement for 'ls'
brew "exa"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Library for manipulating PNG images
brew "libpng"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql@5.7"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# User interface to the TELNET protocol
brew "telnet"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# JavaScript package manager
brew "yarn"
# Tracks most-used directories to make cd smarter
brew "z"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Display management tool
cask "betterdisplay"
# Git client focusing on productivity
cask "gitkraken"
# Game development engine
cask "godot"
# HTTP and GraphQL Client
cask "insomnia"
# System monitoring app
cask "istat-menus"
# Interface for reading and syncing eBooks
cask "kindle"
# Client-side GUI application for modern database development and operations
cask "nosql-workbench"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# MySQL/MariaDB database management
cask "sequel-ace"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# To-do list
cask "todoist"
# Virtualizer for x86 hardware
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
mas "CleanMyMac X", id: 1339170533
mas "Display Menu", id: 549083868
mas "Divvy", id: 413857545
mas "EasyRes", id: 688211836
mas "Fantastical", id: 975937182
mas "Instapaper", id: 288545208
mas "Kindle", id: 405399194
mas "Messenger", id: 1480068668
mas "MKPlayer", id: 1335612105
mas "NordVPN", id: 905953485
mas "Reeder", id: 1529448980
mas "Save to Raindrop.io", id: 1549370672
vscode "42Crunch.vscode-openapi"
vscode "4ops.terraform"
vscode "alefragnani.Bookmarks"
vscode "be5invis.vscode-custom-css"
vscode "bmewburn.vscode-intelephense-client"
vscode "bungcip.better-toml"
vscode "ChakrounAnas.turbo-console-log"
vscode "dbaeumer.vscode-eslint"
vscode "dzannotti.vscode-babel-coloring"
vscode "eamodio.gitlens"
vscode "eriklynd.json-tools"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "kpping.vsmacs"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.sublime-keybindings"
vscode "nickdemayo.vscode-json-editor"
vscode "premparihar.gotestexplorer"
vscode "quicktype.quicktype"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "wesbos.theme-cobalt2"
